
--1. Вопрос: Решите уравнение: x^2 - 4 = 0. Какой корень уравнения x^2 - 4 = 0?
INSERT INTO questions(ques_id, title, optionA, optionB, optionC, ans, chose)
VALUES (
           1,
           'Решите уравнение: x^2 - 4 = 0. Какой корень уравнения x^2 - 4 = 0?',
           'x = -2',
           'x = 2',
           'x = 4',
           2,
           -1
       );

--2. Вопрос: Решите систему уравнений:
--x + y = 5,
--2x - y = 3. Какое значение x получится при решении этой системы?
INSERT INTO questions(ques_id, title, optionA, optionB, optionC, ans, chose)
VALUES (
           2,
           'Решите систему уравнений: x + y = 5, 2x - y = 3. Какое значение x получится при решении этой системы?',
           'x = 2',
           'x = 3',
           'x = 4',
           1,
           -1
       );

--3. Вопрос: Каково значение выражения 2a - 4b при a = 3 и b = 5?
INSERT INTO questions(ques_id, title, optionA, optionB, optionC, ans, chose)
VALUES (
           3,
           'Каково значение выражения 2a - 4b при a = 3 и b = 5?',
           '-4',
           '-2',
           '4',
           2,
           -1
       );

--4. Вопрос: Вычислите значение выражения: (x^2 + 3x - 4) / (x - 1) при x = 2.
INSERT INTO questions(ques_id, title, optionA, optionB, optionC, ans, chose)
VALUES (
           4,
           'Вычислите значение выражения: (x^2 + 3x - 4) / (x - 1) при x = 2.',
           '3',
           '6',
           '8',
           2,
           -1
       );

--5. Вопрос: Решите уравнение: 2x + 7 = 15. Какое значение x будет являться решением уравнения?
INSERT INTO questions(ques_id, title, optionA, optionB, optionC, ans, chose)
VALUES (
           5,
           'Решите уравнение: 2x + 7 = 15. Какое значение x будет являться решением уравнения?',
           '4',
           '5',
           '6',
           1,
           -1
       );


-- 7. Вопрос: Решите уравнение: |x - 2| = 4. Какие значения x будут являться решением этого уравнения?
INSERT INTO questions(ques_id, title, optionA, optionB, optionC, ans, chose)
VALUES (
           6,
           'Решите уравнение: |x - 2| = 4. Какие значения x будут являться решением этого уравнения?',
           '-2 и 6',
           '-4 и 8',
           '-6 и 10',
           2,
           -1
       );

-- 8. Вопрос: Решите уравнение: 3x - 2 = x + 10. Какое значение x будет являться решением этого уравнения?
INSERT INTO questions(ques_id, title, optionA, optionB, optionC, ans, chose)
VALUES (
           7,
           'Решите уравнение: 3x - 2 = x + 10. Какое значение x будет являться решением этого уравнения?',
           '4',
           '6',
           '8',
           3,
           -1
       );

-- 9. Вопрос: Вычислите значение выражения: 2(3x - 4) + 5x при x = 2.
INSERT INTO questions(ques_id, title, optionA, optionB, optionC, ans, chose)
VALUES (
           8,
           'Вычислите значение выражения: 2(3x - 4) + 5x при x = 2.',
           '5',
           '12',
           '15',
           2,
           -1
       );

-- 10. Вопрос: Решите уравнение: 4x^2 + 8x + 3 = 0. Какие корни будут у этого уравнения?
INSERT INTO questions(ques_id, title, optionA, optionB, optionC, ans, chose)
VALUES (
           9,
           'Решите уравнение: 4x^2 + 8x + 3 = 0. Какие корни будут у этого уравнения?',
           'нет корней',
           'два комплексных корня',
           'два действительных корня',
           2,
           -1
       );

-- 11. Вопрос: Решите систему уравнений:
-- 2x + 3y = 11,
-- 4x - y = 5. Какое значение y получится при решении этой системы?
INSERT INTO questions(ques_id, title, optionA, optionB, optionC, ans, chose)
VALUES (
           10,
           'Решите систему уравнений: 2x + 3y = 11, 4x - y = 5. Какое значение y получится при решении этой системы?',
           'y = -3',
           'y = -2',
           'y = -1',
           1,
           -1
       );

-- Конечно, продолжаю:

-- 12. Вопрос: Решите уравнение: 3x + 2 = 5x - 1. Какое значение x будет являться решением уравнения?
INSERT INTO questions(ques_id, title, optionA, optionB, optionC, ans, chose)
VALUES (
           11,
           'Решите уравнение: 3x + 2 = 5x - 1. Какое значение x будет являться решением уравнения?',
           'x = 1',
           'x = 3',
           'x = 4',
           2,
           -1
       );

-- 13. Вопрос: Решите систему уравнений:
-- 2x - y = 7,
-- x + 3y = -5. Какое значение y получится при решении этой системы?
INSERT INTO questions(ques_id, title, optionA, optionB, optionC, ans, chose)
VALUES (
           12,
           'Решите систему уравнений: 2x - y = 7, x + 3y = -5. Какое значение y получится при решении этой системы?',
           'y = -3',
           'y = -2',
           'y = -1',
           1,
           -1
       );

-- 14. Вопрос: Решите уравнение: 2x^2 - 5x - 12 = 0. Какие корни будут у этого уравнения?
INSERT INTO questions(ques_id, title, optionA, optionB, optionC, ans, chose)
VALUES (
           13,
           'Решите уравнение: 2x^2 - 5x - 12 = 0. Какие корни будут у этого уравнения?',
           'x = -2, x = 3/2',
           'x = -3/2, x = 4',
           'x = -4, x = 3/2',
           1,
           -1
       );

-- 15. Вопрос: Вычислите значение выражения: 3a + 4b - 2c при a = 2, b = 3 и c = 4.
INSERT INTO questions(ques_id, title, optionA, optionB, optionC, ans, chose)
VALUES (
           14,
           'Вычислите значение выражения: 3a + 4b - 2c при a = 2, b = 3 и c = 4.',
           '5',
           '7',
           '9',
           2,
           -1
       );

-- 16. Вопрос: Решите уравнение: 2(x + 3) = 5x - 1. Какое значение x будет являться решением уравнения?
INSERT INTO questions(ques_id, title, optionA, optionB, optionC, ans, chose)
VALUES (
           15,
           'Решите уравнение: 2(x + 3) = 5x - 1. Какое значение x будет являться решением уравнения?',
           'x = 4',
           'x = 5',
           'x = 6',
           1,
           -1
       );

INSERT INTO questions (ques_id, title, optionA, optionB, optionC, ans, chose, quiz_id)
VALUES

    (45, 'Какая столица Германии?', 'Берлин', 'Москва', 'Лондон', 1, -1, 2),
    (46, 'Какая столица Италии?', 'Рим', 'Афины', 'Вена', 1, -1, 2),
    (47, 'Какая столица Испании?', 'Мадрид', 'Париж', 'Будапешт', 1, -1, 2),
    (48, 'Какая столица Великобритании?', 'Лондон', 'Дублин', 'Стокгольм', 1, -1, 2),
    (49, 'Какая столица России?', 'Москва', 'Вашингтон', 'Токио', 1, -1, 2),
    (50, 'Какая столица Китая?', 'Пекин', 'Сеул', 'Дели', 1, -1, 2),
    (51, 'Какая столица Японии?', 'Токио', 'Пекин', 'Бангкок', 1, -1, 2),
    (52, 'Какая столица Бразилии?', 'Бразилиа', 'Буэнос-Айрес', 'Сантьяго', 1, -1, 2),
    (53, 'Какая столица Канады?', 'Оттава', 'Вашингтон', 'Торонто', 1, -1, 2),
    (54, 'Какая столица Австралии?', 'Канберра', 'Сидней', 'Мельбурн', 1, -1, 2),
    (55, 'Какая столица Южной Кореи?', 'Сеул', 'Токио', 'Пекин', 1, -1, 2),
    (56, 'Какая столица Мексики?', 'Мехико', 'Мадрид', 'Рио-де-Жанейро', 1, -1, 2),
    (57, 'Какая столица Аргентины?', 'Буэнос-Айрес', 'Сантьяго', 'Лима', 1, -1, 2),
    (58, 'Какая столица Египта?', 'Каир', 'Рим', 'Дамаск', 1, -1, 2);






